
# Принтира на конзолата - Hallo Svetlana
#name = input()
#greetings = input()
#hello = name + greetings
#print("Hello", name)

#name = input()
#print(name)

# Задачата за Джъдж
name = input()
print("Hello, " + name + "!")

# Курсорът остава на същият ред
#name = input()
#print('Hello, ', end='')
#print(name)

# "Долепяне" от лекцията, аналогично решение с моята задача за Джъдж
#name = input()
#print('Hello, ' + name)


